const  parseLRC = (lrc)=>{
    var lrcObj = {}
    var regExp = /\[(\d{2}):(\d{2})\.(\d{3})\](.*)/g;
    //let lrc = "[00:00.000] 作曲 : 李荣浩\n[00:00.285] 作词 : 李荣浩\n[00:00.855]编曲 : 李荣浩\n[00:01.271]制作人 : 李荣浩\n[00:03.185]\n[00:12.510]呵呵呵呵 呵呵呵呵呵\n[00:18.620]呵呵呵呵 呵呵呵呵呵\n[00:24.931]呵呵呵呵呵\n[00:27.996]呵呵呵呵呵\n[00:31.108]呵呵呵呵 呵呵呵呵呵\n[00:38.288]要我怎么\n[00:41.318]要我怎么\n[00:44.348]要我怎么办\n[00:50.659]要我怎么\n[00:53.689]要我怎么\n[00:56.787]要我怎么办\n[01:30.487]哈哈哈哈 哈哈哈哈哈\n[01:36.564]哈哈哈哈 哈哈哈哈哈\n[01:42.776]哈哈哈哈哈\n[01:45.838]哈哈哈哈哈\n[01:48.985]哈哈哈哈 哈哈哈哈哈\n[01:56.095]要我怎么\n[01:59.158]要我怎么\n[02:02.222]要我怎么办\n[02:08.514]要我怎么\n[02:11.613]要我怎么\n[02:14.764]要我怎么办\n[02:21.037]要我怎么\n[02:24.068]要我怎么\n[02:27.181]要我怎么办\n[02:33.492]要我怎么\n[02:36.540]要我怎么\n[02:39.686]要我怎么办\n[02:46.046]要我怎么\n[02:48.976]要我怎么\n[02:52.090]要我怎么办\n[02:58.334]要我怎么\n[03:01.431]要我怎么\n[03:04.578]要我怎么办\n[03:11.855]你想怎么\n[03:20.146]\n[03:20.517]吉他 : 李荣浩\n[03:20.917]贝斯 : 李荣浩\n[03:21.350]和音编写 : 李荣浩\n[03:21.666]和音 : 李荣浩\n[03:22.116]录音师 : 李荣浩\n[03:22.482]混音师 : 李荣浩\n[03:22.933]音乐制作助理 : 青格乐\n[03:23.315]录音工作室 : 北京一样音乐录音室\n[03:23.732]混音工作室 : 北京一样音乐录音室\n[03:24.115]母带后期制作人 : 李荣浩\n[03:24.530]母带后期处理工程师 : 周天澈\n[03:24.963]母带后期处理录音室 : Studio21A\n"
    while (1){
        //                得到匹配格式的歌词
                        var result = regExp.exec(lrc);
        //                参考结果解析匹配歌词
                        if (result){
        //                    判断如果获取到匹配结果 通过time变量接收此句歌词的时间(秒)
                            var time = parseInt(result[1])*60+parseInt(result[2]);
        //                    通过对象属性:把每个解析到的时间匹配此时的歌词,格式obj{key:value}
                            lrcObj[time] = result[4];
                        }else  {
        //                    如果不满足直接跳出
                            break;
                        }
                    }
                    let lrcArr = Object.values(lrcObj)
                    return lrcArr
         
                    
 };
module.exports=parseLRC